; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v3 ?v12)
             (pred_6 ?v6 ?v5)
             (pred_8 ?v3 ?v5)
             (pred_11 ?v2 ?v3 )
	     (pred_4 ?v3)
             (pred_12 ?v11)
             (pred_1 ?v6)
             (pred_5 ?v5)
             (pred_3 ?v3)
             (pred_2 ?v6)
             (pred_7 ?v3)
             (pred_10 ))



(:action op_4
:parameters (?v10 ?v1 ?v4 ?v13)
:precondition (and (pred_12 ?v10) (pred_12 ?v1) (pred_1 ?v4) (pred_5 ?v13)
          (pred_9 ?v10 ?v1) (pred_6 ?v4 ?v13)
                   (pred_8 ?v1 ?v13) (pred_4 ?v10) 
                   (pred_3 ?v1) (pred_2 ?v4))
:effect (and  (pred_7 ?v1) (not (pred_3 ?v1))))


(:action op_3
:parameters (?v10 ?v9)
:precondition (and (pred_12 ?v10) (pred_12 ?v9)
               (pred_4 ?v10) (pred_9 ?v10 ?v9) (pred_7 ?v9))
:effect (and (pred_4 ?v9) (not (pred_4 ?v10))))

(:action op_1
:parameters (?v10 ?v4)
:precondition (and (pred_12 ?v10) (pred_1 ?v4) 
                  (pred_4 ?v10) (pred_11 ?v4 ?v10) (pred_10 ))
:effect (and (pred_2 ?v4)
   (not (pred_11 ?v4 ?v10)) (not (pred_10 ))))


(:action op_2
:parameters (?v10 ?v8 ?v7)
:precondition (and (pred_12 ?v10) (pred_1 ?v8) (pred_1 ?v7)
                  (pred_4 ?v10) (pred_2 ?v7) (pred_11 ?v8 ?v10))
:effect (and (pred_2 ?v8) (pred_11 ?v7 ?v10)
        (not (pred_2 ?v7)) (not (pred_11 ?v8 ?v10))))

(:action op_5
:parameters (?v10 ?v4)
:precondition (and (pred_12 ?v10) (pred_1 ?v4) 
                  (pred_4 ?v10) (pred_2 ?v4))
:effect (and (pred_10 ) (pred_11 ?v4 ?v10) (not (pred_2 ?v4)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_09 obj_18 obj_14 obj_16 obj_21 obj_02 obj_15 obj_10 obj_07 obj_05 obj_12 obj_06 obj_13 obj_17 obj_20
    obj_19 obj_01
    obj_04 obj_08 obj_03
    )

    (:init
       (pred_10)

       (pred_12 obj_11)
       (pred_12 obj_09)
       (pred_12 obj_18)
       (pred_12 obj_14)
       (pred_12 obj_16)
       (pred_12 obj_21)
       (pred_12 obj_02)
       (pred_12 obj_15)
       (pred_12 obj_10)
       (pred_12 obj_07)
       (pred_12 obj_05)
       (pred_12 obj_12)
       (pred_12 obj_06)
       (pred_12 obj_13)
       (pred_12 obj_17)
       (pred_12 obj_20)
       (pred_5 obj_19)
       (pred_5 obj_01)
       (pred_1 obj_04)
       (pred_1 obj_08)
       (pred_1 obj_03)

       (pred_9 obj_11 obj_16)
       (pred_9 obj_11 obj_09)
       (pred_9 obj_09 obj_21)
       (pred_9 obj_09 obj_18)
       (pred_9 obj_09 obj_11)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_18 obj_14)
       (pred_9 obj_18 obj_09)
       (pred_9 obj_14 obj_15)
       (pred_9 obj_14 obj_18)
       (pred_9 obj_16 obj_10)
       (pred_9 obj_16 obj_21)
       (pred_9 obj_16 obj_11)
       (pred_9 obj_21 obj_07)
       (pred_9 obj_21 obj_02)
       (pred_9 obj_21 obj_09)
       (pred_9 obj_21 obj_16)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_02 obj_15)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_02 obj_21)
       (pred_9 obj_15 obj_12)
       (pred_9 obj_15 obj_14)
       (pred_9 obj_15 obj_02)
       (pred_9 obj_10 obj_06)
       (pred_9 obj_10 obj_07)
       (pred_9 obj_10 obj_16)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_07 obj_05)
       (pred_9 obj_07 obj_21)
       (pred_9 obj_07 obj_10)
       (pred_9 obj_05 obj_17)
       (pred_9 obj_05 obj_12)
       (pred_9 obj_05 obj_02)
       (pred_9 obj_05 obj_07)
       (pred_9 obj_12 obj_20)
       (pred_9 obj_12 obj_15)
       (pred_9 obj_12 obj_05)
       (pred_9 obj_06 obj_13)
       (pred_9 obj_06 obj_10)
       (pred_9 obj_13 obj_17)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_13 obj_06)
       (pred_9 obj_17 obj_20)
       (pred_9 obj_17 obj_05)
       (pred_9 obj_17 obj_13)
       (pred_9 obj_20 obj_12)
       (pred_9 obj_20 obj_17)
       (pred_3 obj_14)
       (pred_3 obj_21)
       (pred_3 obj_18)
       (pred_8  obj_14 obj_19)
       (pred_8  obj_21 obj_01)
       (pred_8  obj_18 obj_19)
       (pred_7 obj_11)
       (pred_7 obj_09)
       (pred_7 obj_16)
       (pred_7 obj_02)
       (pred_7 obj_15)
       (pred_7 obj_10)
       (pred_7 obj_07)
       (pred_7 obj_05)
       (pred_7 obj_12)
       (pred_7 obj_06)
       (pred_7 obj_13)
       (pred_7 obj_17)
       (pred_7 obj_20)

       (pred_6  obj_04 obj_19)
       (pred_6  obj_08 obj_01)
       (pred_6  obj_03 obj_19)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_08 obj_20)
       (pred_11 obj_03 obj_06)
       (pred_4 obj_16)
    )

    (:goal (and
       (pred_11 obj_04 obj_10)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_03 obj_05)
    ))
(:constraints
  (always (not (pred_4 obj_07)))
)
)

; plan
1. (op_1 obj_16 obj_04)
   deleted: (pred_11 obj_04 obj_16) (pred_10)
   added: (pred_2 obj_04)
   goals met: 0 of 3
2. (op_3 obj_16 obj_10)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_10)
   goals met: 0 of 3
3. (op_5 obj_10 obj_04)
   deleted: (pred_2 obj_04)
   added: (pred_10) (pred_11 obj_04 obj_10)
   goals met: 1 of 3
4. (op_3 obj_10 obj_06)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_06)
   goals met: 1 of 3
5. (op_3 obj_06 obj_13)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_13)
   goals met: 1 of 3
6. (op_3 obj_13 obj_17)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_17)
   goals met: 1 of 3
7. (op_3 obj_17 obj_20)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_20)
   goals met: 1 of 3
8. (op_1 obj_20 obj_08)
   deleted: (pred_11 obj_08 obj_20) (pred_10)
   added: (pred_2 obj_08)
   goals met: 1 of 3
9. (op_3 obj_20 obj_17)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_17)
   goals met: 1 of 3
10. (op_3 obj_17 obj_05)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_05)
   goals met: 1 of 3
11. (op_5 obj_05 obj_08)
   deleted: (pred_2 obj_08)
   added: (pred_10) (pred_11 obj_08 obj_05)
   goals met: 2 of 3
12. (op_3 obj_05 obj_17)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_17)
   goals met: 2 of 3
13. (op_3 obj_17 obj_13)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_13)
   goals met: 2 of 3
14. (op_3 obj_13 obj_06)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_06)
   goals met: 2 of 3
15. (op_1 obj_06 obj_03)
   deleted: (pred_11 obj_03 obj_06) (pred_10)
   added: (pred_2 obj_03)
   goals met: 2 of 3
16. (op_3 obj_06 obj_13)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_13)
   goals met: 2 of 3
17. (op_3 obj_13 obj_17)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_17)
   goals met: 2 of 3
18. (op_3 obj_17 obj_05)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_05)
   goals met: 2 of 3
19. (op_5 obj_05 obj_03)
   deleted: (pred_2 obj_03)
   added: (pred_10) (pred_11 obj_03 obj_05)
   goals met: 3 of 3
